In [23]:
import pandas as pd
import numpy as np
returns = pd.read_csv('Portfolios_Formed_on_ME_monthly_EW.csv',
                      header=0, index_col=0,parse_dates=True, na_values=-99.99
                    )

In [100]:
returns.head()

                        Lo 20     Hi 20
1999-01-01 00:01:00  0.001114  0.000153
1999-01-01 00:02:00 -0.000399 -0.000172
1999-01-01 00:03:00 -0.000308  0.000368
1999-01-01 00:04:00  0.000824  0.000679
1999-01-01 00:05:00  0.000435 -0.000048

In [98]:
columns = ['Lo 20','Hi 20']
returns = returns[columns]
returns.head()

                        Lo 20     Hi 20
1999-01-01 00:01:00  0.001114  0.000153
1999-01-01 00:02:00 -0.000399 -0.000172
1999-01-01 00:03:00 -0.000308  0.000368
1999-01-01 00:04:00  0.000824  0.000679
1999-01-01 00:05:00  0.000435 -0.000048

In [101]:

returns = returns/100
returns.head()

                        Lo 20         Hi 20
1999-01-01 00:01:00  0.000011  1.530000e-06
1999-01-01 00:02:00 -0.000004 -1.720000e-06
1999-01-01 00:03:00 -0.000003  3.680000e-06
1999-01-01 00:04:00  0.000008  6.790000e-06
1999-01-01 00:05:00  0.000004 -4.800000e-07

In [88]:
returns.std()

Lo 20    0.000661
Hi 20    0.000499
dtype: float64

In [89]:
annualized_vol = returns.std()*np.sqrt(12)
annualized_vol

Lo 20    0.002289
Hi 20    0.001727
dtype: float64

In [90]:
n_month = returns.shape[0]
return_per_month = (returns+1).prod()**(1/n_month)-1
return_per_month

Lo 20    0.000112
Hi 20    0.000063
dtype: float64

In [92]:
annualized_return = (return_per_month+1)**12-1

annualized_return

Lo 20    0.001343
Hi 20    0.000760
dtype: float64

In [93]:
annualized_return = (returns+1).prod()**(12/n_month)-1

annualized_return

Lo 20    0.001343
Hi 20    0.000760
dtype: float64

In [104]:
columns = ['Lo 20','Hi 20']
returns = returns[columns]
returns.head()

                        Lo 20         Hi 20
1999-01-01 00:01:00  0.000011  1.530000e-06
1999-01-01 00:02:00 -0.000004 -1.720000e-06
1999-01-01 00:03:00 -0.000003  3.680000e-06
1999-01-01 00:04:00  0.000008  6.790000e-06
1999-01-01 00:05:00  0.000004 -4.800000e-07

In [66]:
returns

                      Lo 20   Hi 20
1999-01-01 00:01:00  0.1114  0.0153
1999-01-01 00:02:00 -0.0399 -0.0172
1999-01-01 00:03:00 -0.0308  0.0368
1999-01-01 00:04:00  0.0824  0.0679
1999-01-01 00:05:00  0.0435 -0.0048
...                     ...     ...
2015-01-01 00:08:00 -0.0347 -0.0559
2015-01-01 00:09:00 -0.0610 -0.0333
2015-01-01 00:10:00  0.0385  0.0710
2015-01-01 00:11:00  0.0165  0.0015
2015-01-01 00:12:00 -0.0500 -0.0229

[204 rows x 2 columns]

In [103]:
#returns = returns.loc['1999':'2015']
#returns

In [102]:
returns.index = pd.to_datetime(returns.index, format = "Y%")
#returnss9915= returns["1999":"2015"]
returns

                        Lo 20         Hi 20
1999-01-01 00:01:00  0.000011  1.530000e-06
1999-01-01 00:02:00 -0.000004 -1.720000e-06
1999-01-01 00:03:00 -0.000003  3.680000e-06
1999-01-01 00:04:00  0.000008  6.790000e-06
1999-01-01 00:05:00  0.000004 -4.800000e-07
...                       ...           ...
2015-01-01 00:08:00 -0.000003 -5.590000e-06
2015-01-01 00:09:00 -0.000006 -3.330000e-06
2015-01-01 00:10:00  0.000004  7.100000e-06
2015-01-01 00:11:00  0.000002  1.500000e-07
2015-01-01 00:12:00 -0.000005 -2.290000e-06

[204 rows x 2 columns]

In [81]:
returns.std()

Lo 20    0.000661
Hi 20    0.000499
dtype: float64

In [82]:
annualized_vol = returns.std()*np.sqrt(12)
annualized_vol

Lo 20    0.002289
Hi 20    0.001727
dtype: float64

In [83]:
n_month = returns.shape[0]
return_per_month = (returns+1).prod()**(1/n_month)-1
return_per_month

Lo 20    0.000112
Hi 20    0.000063
dtype: float64

In [84]:
annualized_vol

Lo 20    0.002289
Hi 20    0.001727
dtype: float64

In [85]:
annualized_return = (return_per_month+1)**12-1
annualized_return

Lo 20    0.001343
Hi 20    0.000760
dtype: float64

In [105]:
import edhec_risk_kit as erk
erk.get_ffme_returns()

NameError: name 'hfi' is not defined